// файл будет включён в единицу трансляции только один раз, даже если #include 
// встретится несколько раз.
#pragma once

// Стандартный C++ заголовок с типами int
#include <cstdint>

// Ключевой заголовок CXX, который CXX генерирует и поставляет вместе с крейтом.
#include "rust/cxx.h"

/*
фунуция приветствия greet()

Разбор типов:
Часть	        Что означает
--------------- -------------------------------------
rust::String	возвращаемый тип — аналог Rust String
greet	        имя функции
rust::Str name	параметр — аналог Rust &str
*/
rust::String greet(rust::Str name);

/*
фунуция сложения add()

Часть	        Что означает
--------------- ------------------------------------------
std::int32_t	знаковое 32-битное целое (аналог Rust i32)
add	            имя функции
left, right	    параметры
*/
std::int32_t add(std::int32_t left, std::int32_t right);
