/*
Парсит содержимое модуля ffi на этапе компиляции.

Генерирует:
 1. Rust-код, вызывающий C++-функции через FFI;
 2. C++-код прокладок (shims), которые будут вызывать Rust-функции из C++;
     заголовочный файл для C++-стороны.
 3. Проверяет соответствие типов между Rust и C++ — если что-то не стыкуется, ошибка компиляции.
*/
// Макрос #[cxx::bridge] обязателен.
#[cxx::bridge] // Макрос-атрибут из крейта cxx, который превращает обычный модуль Rust в FFI-мост.
mod ffi {   // имя модуля ffi — произвольное
    unsafe extern "C++" { // C++-функции, вызываемые из Rust
        // Специальная директива CXX, которая говорит генератору:
        // «В C++-коде прокладок добавь #include "greeter.h"».
        include!("greeter.h");

        // Описаны сигнатуры C++-функций, как их видит Rust.
        // имена greet и add в bridge-модуле должны точно совпадать с именами функций в C++ 
        // (greeter.h / greeter.cc). 
        // CXX использует их как единый идентификатор для обеих сторон.
        fn greet(name: &str) -> String;
        fn add(left: i32, right: i32) -> i32;
    }
}

fn main() {
    let x = 20 ;
    let y = 22 ;

    let message = ffi::greet("Rust");
    let sum = ffi::add(x, y);

    println!("{message}");  // Out: Hello from C++, Rust!
    println!("{x} + {y} = {sum}");    // Out: 20 + 22 = 42
}
